benjamin-simmonds.pythoncpp-debug
charliermarsh.ruff
equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons
esbenp.prettier-vscode
github.copilot
github.copilot-chat
james-yu.latex-workshop
mathematic.vscode-latex
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ritwickdey.liveserver
tw.monokai-accent
vscodevim.vim
